Repository: MVolodya/EasyBank
Catalog: EasyBank/Resources/Resource.*.resx
Languages: ru, uk_ua

source: Account number required
ru: Требуется номер счета
uk_ua: Потрібен номер рахунку

source: Account status required
ru: Требуется статус счета
uk_ua: Потрібен статус рахунку

source: Account type required
ru: Требуется тип счета
uk_ua: Потрібен тип рахунку

source: Amount required
ru: Требуется сумма
uk_ua: Потрібна сума

# BirthDateRequired
source: PId number required
ru: Требуется дата рождения
uk_ua: Потрібна дата народження

# ChooseLang
source: Choose Language
ru: Выберите язык
uk_ua: Виберіть мову

# ClientIdRequired
source: Client required
ru: Требуется клиент
uk_ua: Потрібен клієнт

source: Country
ru: Страна
uk_ua: Країна

# CurrencyIdRequired
source: Currency required
ru: Требуется валюта
uk_ua: Потрібна валюта

source: Currency name required
ru: Требуется название валюты
uk_ua: Потрібна назва валюти

# DateNotValid
source: Date is not Valid
ru: Ошибочный ввод даты
uk_ua: Невірна дата

source: Email required
ru: Требуется электронный адрес
uk_ua: Потрібна поштова скринька

source: Expiration date required
ru: Требуется срок действия
uk_ua: Потрібен термін дії

# Len8
source: Length must be 8 chars
ru: Длинна должна быть 8 симоволов
uk_ua: Довжина повинна бути 8 символів

# NameFromCap
source: Must start with capital letter and have latin characters only
ru: Должно начинаться с большой буквы и состоять только из латинских букв
uk_ua: Повинне починатись з великої літери та складатись із латинських букв

# NameLen3To20
source: Name must have length from 3 to 20 characters
ru: В этом поле должно быть от 3 до 20 символов
uk_ua: Це поле повинне вміщувати від 3 до 20 символів

# NameRequired
source: First name required
ru: Требуется имя
uk_ua: Потрібне ім'я

# OnlyDigits
source: Only digits are allowed
ru: Только цифры
uk_ua: Тільки цифри дозволені

source: PId number required
ru: Требуется идентификационный код
uk_ua: Потрібен ідентифікаційний код

# StatusIdRequired
source: Status required
ru: Требуется статус
uk_ua: Потрібен статус

source: Surname required
ru: Требуется фамилия
uk_ua: Потрібне прізвище

# SurnLen3To30
source: Surname must have length from 3 to 30 characters
ru: В этом поле должно быть от 3 до 20 символов
uk_ua: Це поле повинне вміщувати від 3 до 30 символів

source: Template
ru: Шаблон
uk_ua: Шаблон

# TypeIdRequired
source: Type required
ru: Требуется тип
uk_ua: Потрібен тип

# AccNumb
source: Account Number
ru: Номер счета
uk_ua: Номер рахунку

source: Amount
ru: Сумма
uk_ua: Сума

source: Back to list
ru: Вернуться к списку
uk_ua: Повернутися до списку

source: Birth Date
ru: Дата рождения
uk_ua: Дата народження

source: Client
ru: Клиент
uk_ua: Клієнт

source: Currency
ru: Валюта
uk_ua: Валюта

# ExpDate
source: Expiration Date
ru: Дата окончания действия
uk_ua: Дата закінчення дії

source: Name
ru: Имя
uk_ua: Ім'я

# PIdNum
source: PId Number
ru: Идентификационный код
uk_ua: Ідентифікаційний номер

# RegDate
source: Registration Date
ru: Дата регистрации
uk_ua: Дата реєстрації

source: Status
ru: Статус
uk_ua: Статус

source: Surname
ru: Фамилия
uk_ua: Прізвище

source: Type
ru: Тип
uk_ua: Тип

# AccountsTitle
source: Accounts
ru: Счета
uk_ua: Рахунки

# AddAccount
source: Add new account
ru: Создать счет
uk_ua: Створити рахунок

# AddClient
source: Add new client
ru: Добавить клиента
uk_ua: Додати клієнта

source: Add money
ru: Добавить деньги
uk_ua: Додати кошти

source: Add photo
ru: Добавить фото
uk_ua: Додати фото

# AdviceMessageInClientListSearch
source: Make sure you've entered correct information and try again!
ru: Убедитесь, что Вы ввели корректную информацию в поиске
uk_ua: Переконайтесь, що Ви ввели правильну інформацію в пошуку

# ClientListSearchTypeRequirement
source: Enter surname or identification number
ru: Введите фамилию или идентификационный код клиента
uk_ua: Введіть прізвище або ідентифікаційний код клієнта

source: Client not found
ru: Клиент не найден
uk_ua: Клієнт не знайдений

# ClientsListTitle
source: Client list
ru: Список клиентов
uk_ua: Список клієнтів

# ClientsProfileTitle
source: Clients profile
ru: Профиль клиента
uk_ua: Профіль клієнта

source: Delete
ru: Удалить
uk_ua: Видалити

source: Details
ru: Подробности
uk_ua: Мій профіль

source: Edit
ru: Редактировать
uk_ua: Редагувати

source: Passport
ru: Паспорт
uk_ua: Паспорт

# TransMoney
source: Transfer money
ru: Перевести деньги
uk_ua: Переказати кошти

source: of
ru: из
uk_ua: з

source: Page
ru: Страница
uk_ua: Сторінка

source: Search
ru: Поиск
uk_ua: Пошук

source: Accounts are absent
ru: Счета отсутствуют
uk_ua: Немає жодного рахунку

source: Choose file
ru: Выбрать файл
uk_ua: Обрати файл

source: Clients list
ru: Список клиентов
uk_ua: Список клієнтів

# ClientsPhotoTitle
source: Clients photo
ru: Фотография клиента
uk_ua: Фотографія клієнта

source: Create
ru: Создать
uk_ua: Створити

# FileUpload
source: Upload file
ru: Загрузить файл
uk_ua: Завантажити файл

source: Home
ru: Главная страница
uk_ua: Головна сторінка

# NoPhoto
source: Client has no photo
ru: Нет фотографии
uk_ua: Фотографія відсутня

# UploadClientPhotoTitle
source: Upload client photo
ru: Загрузить фотографию клиента
uk_ua: Завантажити фотографію клієнта

source: Upload image
ru: Загрузка фотографии
uk_ua: Завантаження фотографії

source: Upload passport scan
ru: Загрузить паспорт
uk_ua: Завантажити паспорт

# AskToDeleteCurrency
source: Are you sure you want to delete this?
ru: Вы уверенны, что хотите удалить валюту?
uk_ua: Ви впевненні, що бажаєте видалити валюту?

source: Currencies
ru: Валюты
uk_ua: Валюти

# CurrencyList
source: Currencies list
ru: Список валют
uk_ua: Список валют

source: Add currency
ru: Добавить валюту
uk_ua: Додати валюту

source: Save
ru: Сохранить
uk_ua: Зберегти

# WelcomeMessage
source: Welcome to Easy Bank!
ru: Добро пожаловать в Easy Bank!
uk_ua: Ласкаво просимо до Easy Bank!

# EmailInvalid
source: Invalid email
ru: Некорректный адрес
uk_ua: Невірний адрес

# Len10
source: This field must be 10 characters long
ru: Длина должна быть 10 символов
uk_ua: Довжина повинна мати 10 символів

# WrongFileChoose
source: Wrong input type. Image is expected.
ru: Ошибка загрузки. Файл должен быть картинкой
uk_ua: Помилка: файл має бути зображенням

source: Available amount
ru: Доступная сумма
uk_ua: Доступна сума

# IsOnlineUser
source: Is online system user
ru: Пользователь онлайн банкинга
uk_ua: Користувач інтернет банкінгу

# WrongLogInForAdminAndOperPage
source: Only for admins and operators
ru: Вход только для администраторов и операторов
uk_ua: Вхід тільки для операторів та адміністраторів

# WrongLogInForClientPage
source: Only for clients
ru: Вход только для клиентов
uk_ua: Вхід тільки для клієнтів

source: Widthdraw money
ru: Снять деньги
uk_ua: Зняти гроші

# DecimalFormat
source: Amount must have a formal like (0.00 or 0.0 or 0)
ru: Сумма должна иметь формат (0.00 або 0.0 або 0)
uk_ua: Сума повинна мати формат (0.00 або 0.0 або 0)

source: Add bank product
ru: Добавить банковский продукт
uk_ua: Додати банківський продукт

# AskToAddMoney
source: Are you sure that you want to add money?
ru: Вы уверенны, что хотите добавить деньги?
uk_ua: Ви впевнені, що хочете додати кошти?

source: Back to profile
ru: Вернуться к профилю
uk_ua: Повернутися до профілю

source: Bank products
ru: Продукты банка
uk_ua: Продукти банку

source: Change password
ru: Изменение пароля
uk_ua: Зміна паролю

source: Clients
ru: Клиенты
uk_ua: Клієнти

source: Clients passport
ru: Паспорт клиента
uk_ua: Паспорт клієнта

source: Clients profile
ru: Профиль клиента
uk_ua: Профіль клієнта

source: Credit name
ru: Название кредита
uk_ua: Назва кредиту

source: Credits
ru: Кредиты
uk_ua: Кредити

source: Currency delete
ru: Удалить валюту
uk_ua: Видалити валюту

source: Deposit name
ru: Название депозита
uk_ua: Назва депозиту

source: Deposits
ru: Депозиты
uk_ua: Депозити

source: Describe the problem
ru: Опишите проблему
uk_ua: Опишіть проблему

source: Duration
ru: Продолжительность
uk_ua: Тривалість

source: Early termination
ru: Досрочное окончание
uk_ua: Дострокове закінчення

# EarlyTerminationCredit
source: Early termination
ru: Досрочное погашение
uk_ua: Дострокове погашення

source: Enter
ru: Войти
uk_ua: Увійти

source: Error code
ru: Код ошибки
uk_ua: Код помилки

# ErrorTakeMoneyFromCreditAcc
source: Error: Can't take money from credit account
ru: Ошибка: Невозможно снять деньги из кредитного счета
uk_ua: Помилка: Неможливо зняти кошти з кредитного рахунку

source: Financial reports
ru: Финансовые отчеты
uk_ua: Фінансові звіти

source: Hello
ru: Вы вошли в систему как
uk_ua: Ви увійшли в систему як

source: Interest rate
ru: Процентная ставка
uk_ua: Відсоткова ставка

source: Log in
ru: Войти
uk_ua: Увійти

source: Log in for clients
ru: Вход для клиентов
uk_ua: Вхід для клієнтів

# LoginHelpMessage
source: Use your credentials to enter the system.
ru: Используйте Ваши учетные данные для входа в систему.
uk_ua: Використайте Ваші облікові дані для входу в систему.

# LogInTitle
source: Log in
ru: Вход
uk_ua: Вхід

source: Log off
ru: Выйти
uk_ua: Вийти

source: Operation error
ru: Ошибка операции
uk_ua: Помилка операції

# OperationErrorMessage
source: Please contact system administrator or operator
ru: Пожалуйста, обратитесь к системному администратору или оператору
uk_ua: Будь ласка, зверніться до системного адміністратора або оператора

source: Operators
ru: Операторы
uk_ua: Оператори

source: Operators list
ru: Список операторов
uk_ua: Список операторів

source: Pay in
ru: Внести средства
uk_ua: Внести кошти

source: Pay out
ru: Снять средства
uk_ua: Зняти кошти

source: Refresh
ru: Обновить
uk_ua: Оновити

source: Register operator
ru: Зарегистрировать оператора
uk_ua: Зареєструвати оператора

source: Submit
ru: Подтвердить
uk_ua: Підтвердити

source: Submit entry
ru: Отправить
uk_ua: Відправити

source: Take a picture
ru: Сфотографировать
uk_ua: Сфотографувати

source: Total credit amount
ru: Общая сумма кредитов
uk_ua: Загальна сума кредиту

source: Total deposited amount
ru: Общая сумма депозитов и текущих счетов
uk_ua: Загальна сума депозиту

# TotalDepositInterests
source: Total deposits interests
ru: Сумма начислений по депозитам
uk_ua: Сума нарахувань за депозитами

# TransferErrorFromCreditAcc
source: Error: Can't transfer money from credit account
ru: Ошибка: Невозможно перевести средства из кредитного счета
uk_ua: Помилка: Неможливо переказати кошти з кредитного рахунку

source: Transfer funds
ru: Перевод средств
uk_ua: Грошові перекази

source: Type the symbols
ru: Введите символы из картинки
uk_ua: Введіть символи з картинки

source: Type the text
ru: Введите текст
uk_ua: Введіть текст

source: Withdraw funds
ru: Вывод средств
uk_ua: Вивід коштів

source: Wrong capcha input
ru: Введены неправильные символы из картинки
uk_ua: Введено неправильні символи з картинки

# YouAreLoggedInAs
source: You're logged in as
ru: Вы вошли как
uk_ua: Ви ввійшли як

source: Block
uk_ua: Заблокувати

source: Freeze
uk_ua: Заморозити

source: Set to normal
uk_ua: Розблокувати
